giraydorukyurt7/STM32-Tutorial-Projects/006_2_STDP_ADC_DAC/src/main.c
#include "stm32f4xx.h"
#include "stm32f4_discovery.h"

GPIO_InitTypeDef GPIO_InitStruct;
DAC_InitTypeDef DAC_InitStruct;
ADC_InitTypeDef ADC_InitStruct;
ADC_CommonInitTypeDef ADC_CommonInitStruct;

uint16_t adc_value;

void GPIO_Config()
	{
		 RCC_AHB1PeriphClockCmd(RCC_AHB1Periph_GPIOA, ENABLE);

		 //Bu structure GPIOA  (A) portuna atandi
		 GPIO_InitStruct.GPIO_Mode		 = GPIO_Mode_AN;
		 GPIO_InitStruct.GPIO_Pin		 = GPIO_Pin_0;
		 GPIO_InitStruct.GPIO_OType		 = GPIO_OType_PP;
		 GPIO_InitStruct.GPIO_PuPd		 = GPIO_PuPd_NOPULL;
		 GPIO_InitStruct.GPIO_Speed		 = GPIO_Speed_100MHz;

		 GPIO_Init(GPIOA, &GPIO_InitStruct);

		 //Bu structure GPIOA  (A) portuna atandi
		 GPIO_InitStruct.GPIO_Mode		 = GPIO_Mode_OUT;
		 GPIO_InitStruct.GPIO_Pin		 = GPIO_Pin_4;
		 GPIO_InitStruct.GPIO_OType		 = GPIO_OType_PP;
		 GPIO_InitStruct.GPIO_PuPd		 = GPIO_PuPd_NOPULL;
		 GPIO_InitStruct.GPIO_Speed		 = GPIO_Speed_100MHz;

		 GPIO_Init(GPIOA, &GPIO_InitStruct);
	}

void DAC1_Config()
{
	RCC_APB1PeriphClockCmd(RCC_APB1Periph_DAC, ENABLE);

	DAC_InitStruct.DAC_WaveGeneration				= DAC_WaveGeneration_None;
	DAC_InitStruct.DAC_Trigger						= DAC_Trigger_None;
	DAC_InitStruct.DAC_OutputBuffer					= DAC_OutputBuffer_Enable;

	DAC_Init(DAC_Channel_1, &DAC_InitStruct);

	DAC_Cmd(DAC_Channel_1, ENABLE);
}

void ADC_Config()
{
	RCC_APB2PeriphClockCmd(RCC_APB2Periph_ADC1, ENABLE);

	ADC_CommonInitStruct.ADC_Mode				= ADC_Mode_Independent;
	ADC_CommonInitStruct.ADC_Prescaler			= ADC_Prescaler_Div4;

	ADC_CommonInit(&ADC_CommonInitStruct);

	ADC_InitStruct.ADC_Resolution				= ADC_Resolution_12b;

	ADC_Init(ADC1, &ADC_InitStruct);

	ADC_Cmd(ADC1, ENABLE);
}

uint16_t Read_ADC()
{
	ADC_RegularChannelConfig(ADC1, ADC_Channel_1, 1, ADC_SampleTime_56Cycles);

	ADC_SoftwareStartConv(ADC1);

	while(ADC_GetFlagStatus(ADC1,ADC_FLAG_EOC) == RESET);

	return ADC_GetConversionValue(ADC1);
}

int main(void)
{
	GPIO_Config();
	DAC1_Config();
	ADC_Config();
	while (1)
	{
		adc_value = Read_ADC();

		DAC_SetChannel1Data(DAC_Align_12b_R, adc_value);
	}
}

void EVAL_AUDIO_TransferComplete_CallBack(uint32_t pBuffer, uint32_t Size)
{
  /* TODO, implement your code here */
  return;
}

uint16_t EVAL_AUDIO_GetSampleCallBack(void)
{
  /* TODO, implement your code here */
  return -1;
}
